Revit 2027 API
FabricationNetworkChangeService Constructor
 Creates a new instance of the FabricationNetworkChangeService class.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FabricationNetworkChangeService(
	Document document
)
Public Sub New (
	document As Document
)
public:
FabricationNetworkChangeService(
	Document^ document
)
new :
        document : Document -> FabricationNetworkChangeService
Parameters
document Document
 A document in which to change the service or size of the selected fabrication parts.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace